----------------------------------------------------------------------------------------------------
--- 表格名稱：MatTransMonth (Material Transaction Month)
--- 表格說明：資材每月庫存交易檔
--- 編訂人員：孫培然 
--- 校閱人員：孫培然
--- 設計日期：2021/05/11
---.5...10...15...20...25...30...35...40...45...50...55...60...65...70...75...80...85...90...95..100
use HealthResource;
 
create table MatTransMonth
(
 TranMonth        int                           not null, -- 交易月份
                                                          ------------------------------------------
                                                          -- 格式: YYYYMM
                                                          ------------------------------------------ 
 StockNo          char(04)                      not null, -- 庫存編號
 TranType         tinyint                       not null, -- 交易類別
                                                          ------------------------------------------
                                                          -- 初始
                                                          ------------------------------------------
                                                          -- 0: 期初數量
                                                          ------------------------------------------
                                                          -- 入庫
                                                          ------------------------------------------
                                                          -- 20: 訂單驗收
                                                          -- 21: 贈品驗收
                                                          -- 22: 樣品驗收
                                                          -- 23: 寄賣驗收
                                                          ------------------------------------------
                                                          -- 出庫/消耗
                                                          ------------------------------------------
                                                          -- 25: 盤點消耗(常規申請)
                                                          -- 26: 小領消耗(臨時申請)
                                                          -- 27: 批價消耗
                                                          -- 35: (採購)退貨
                                                          -- 36: (贈品)退貨
                                                          -- 37: (樣品)退貨
                                                          -- 38: (寄賣)退貨
                                                          ------------------------------------------
                                                          -- 其他
                                                          ------------------------------------------
                                                          -- 40: 廠商換入
                                                          -- 45: 廠商換出-滯品
                                                          -- 50: 廠商換出-不良品
                                                          -- 55: 樣品資材
                                                          -- 60: 臨床試驗用藥
                                                          -- 65: 研究計劃用入庫
                                                          -- 70: 製劑出庫
                                                          -- 80: 報廢或破損
                                                          ------------------------------------------
                                                          -- 異動原因
                                                          ------------------------------------------
                                                          -- 10:  盤點數量
                                                          -- 180: 調撥
                                                          -- 185: 移轉
                                                          -- 190: 請領
                                                          -- 191: 小領
                                                          -- 195: 退領
                                                          -- 200: 盤點調整
                                                          -- 205: 借貨退回
                                                          -- 210: 不良品退回
                                                          -- 215: 不適用退回
                                                          -- 220: 請領錯誤退回
                                                          -- 225: 用量減少退回
                                                          ------------------------------------------
 MatCode          decimal(11,4)                 not null, -- 資材代碼
 TotQty           int                           not null, -- 數量
                                                          ------------------------------------------
                                                          -- >0 : 入庫數量
                                                          -- <0 : 出庫數量                                                          
                                                          ------------------------------------------
 SystemUser       int                           not null, -- 系統異動人員
 SystemTime       datetime                      not null, -- 系統異動時間

 constraint MatTransMonthPKey primary key(StockNo,MatCode,TranMonth,TranType)
)
create index MatTransMonthKey1 on MatTransMonth (TranMonth,StockNo,MatCode,TranType,TotQty)
